Tekla Open API Reference for Tekla Structures 2025
Face.Normal Property
 The normal vector of the face.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Vector Normal { get; }
Public ReadOnly Property Normal As Vector
	Get
Property Value
Type: Vector
See Also
Reference
Face Class
Tekla.Structures.Solid Namespace